Revit 2027 API
ParameterTypeId.RbsElecCircuitCoreTypeParam Property
 "Core Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecCircuitCoreTypeParam { get; }
Public Shared ReadOnly Property RbsElecCircuitCoreTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecCircuitCoreTypeParam {
	ForgeTypeId^ get ();
}
static member RbsElecCircuitCoreTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace